Revit 2027 API
UIApplication.GetRibbonPanels(Tab) Method
 Get all the custom Panels on a designated standard Revit tab.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual List<RibbonPanel> GetRibbonPanels(
	Tab tab
)
Public Overridable Function GetRibbonPanels (
	tab As Tab
) As List(Of RibbonPanel)
public:
virtual List<RibbonPanel^>^ GetRibbonPanels(
	Tab tab
)
abstract GetRibbonPanels :
        tab : Tab -> List<RibbonPanel>
override GetRibbonPanels :
        tab : Tab -> List<RibbonPanel>
Parameters
tab Tab
The tab on which the panels are located.
Return Value
List<RibbonPanel>
Remarks
 Built-in panels will not be included. This method is not supported in Macros.
See Also
Reference
UIApplication Class
GetRibbonPanels Overload
Autodesk.Revit.UI Namespace